#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=4e91f376-a5aa-41cd-87a8-05fcf0122a45]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=a9625322-9ea9-4a07-873f-82cfe31bad61]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=e0af79f8-1908-4eb7-8abf-50c40889a0e7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/4e91f376-a5aa-41cd-87a8-05fcf0122a45]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/a9625322-9ea9-4a07-873f-82cfe31bad61]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/e0af79f8-1908-4eb7-8abf-50c40889a0e7]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "e0af79f8-1908-4eb7-8abf-50c40889a0e7"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "9736c14e-558b-4883-b1c7-8811d6058250"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "013fbd55-fafd-4fc6-af6e-9885edd56a65",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "535036a4-b46f-4a6f-9438-4490d022eada",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "74d301f6-b8a2-447e-8402-39b47e280f80",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "a9625322-9ea9-4a07-873f-82cfe31bad61"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "e5508209-a1d2-4363-98cc-0fc729026ab5"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "5d94bc1c-344c-4881-b205-ed61367364de",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e13516c6-b51d-4ad8-97b4-b98962903ce7",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "4e91f376-a5aa-41cd-87a8-05fcf0122a45"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "be0583c5-21db-4fd2-a977-1a1acc411b28"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          - "8cf2768f-f734-4960-94da-44e5fe2e2e6d",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          - "c4e5eda0-3981-46d2-805a-2f8f347edaf2",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "0e4b9ded-1570-4b07-ad52-5715727fa5e0",
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          - "9e988bd9-dbda-40b9-9e81-35c593303e11",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "bcparks-service-transformation-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "viewer-custom-realms-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viewer-custom-realms-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "viewer-custom-realms"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "viewer-custom-realms"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_openid_client.clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "bcparks-service-transformation-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_authorization["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_events["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_identity_providers["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_realm["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.data.keycloak_role.view_users["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "viewer-custom-realms-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viewer-custom-realms-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "viewer-custom-realms"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "viewer-custom-realms"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_openid_client.clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "bcparks-service-transformation-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_authorization["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_clients["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_events["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_identity_providers["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_realm["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.data.keycloak_role.view_users["bcparks-service-transformation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.master_viewer_role.keycloak_openid_client.viewer_service_account will be created
  + resource "keycloak_openid_client" "viewer_service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "viewer-custom-realms-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "viewer-custom-realms-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role will be created
  + resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "viewer-custom-realms"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.master_viewer_role.keycloak_role.viewer will be created
  + resource "keycloak_role" "viewer" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "viewer-custom-realms"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "013fbd55-fafd-4fc6-af6e-9885edd56a65",
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "535036a4-b46f-4a6f-9438-4490d022eada",
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "74d301f6-b8a2-447e-8402-39b47e280f80",
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "5d94bc1c-344c-4881-b205-ed61367364de",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e13516c6-b51d-4ad8-97b4-b98962903ce7",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          + "8cf2768f-f734-4960-94da-44e5fe2e2e6d",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          + "c4e5eda0-3981-46d2-805a-2f8f347edaf2",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "0e4b9ded-1570-4b07-ad52-5715727fa5e0",
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          + "9e988bd9-dbda-40b9-9e81-35c593303e11",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 18 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @junminahn, Action: `pull_request`*